Repository: AmigaPorts/flexcat
Catalog: src/locale/*.po
Languages: italian

# MSG_USAGE_HEAD (0//)
source: Usage:
italian: Utilizzo:

# MSG_FILEUPTODATE (2//)
source: File '%s' is up to date
italian: Il file '%s' è stato aggiornato

# MSG_ERR_WARNING (100//)
source: %s, line %d - warning:
italian: %s, linea %d - Avviso:

# MSG_ERR_ERROR (101//)
source: %s, line %d - ERROR:
italian: %s, linea %d - ERRORE:

# MSG_ERR_EXPECTEDHEX (102//)
source: expected hex character (one of [0-9a-fA-F])
italian: atteso carattere esadecimale (compreso tra [0-9a-fA-F])

# MSG_ERR_EXPECTEDOCTAL (103//)
source: expected octal character (one of [0-7])
italian: atteso carattere ottale (compreso tra [0-7])

# MSG_ERR_NOLENGTHBYTES (104//)
source: lengthbytes cannot be larger than %d (sizeof long)
italian: LengthBytes non può essere più largo di %d (sizeof long)

# MSG_ERR_UNKNOWNCDCOMMAND (105//)
source: unknown catalog description command
italian: comando sconosciuto nel file descrizione

# MSG_ERR_UNEXPECTEDBLANKS (106//)
source: unexpected blanks
italian: spazi inattesi

# MSG_ERR_NOIDENTIFIER (107//)
source: missing identifier
italian: identificatore mancante

# MSG_ERR_MISSINGSTRING (115//)
source: unexpected end of file (missing catalog strings)
italian: inattesa fine del file (stringhe catalog mancanti)

# MSG_ERR_UNKNOWNCTCOMMAND (118//)
source: unknown command in translation
italian: comando sconosciuto nel file traduzione

# MSG_ERR_UNKNOWNIDENTIFIER (119//)
source: '%s' missing in catalog description
italian: '%s' mancante nel file descrizione .CD

# MSG_ERR_UNKNOWNSTRINGTYPE (120//)
source: unknown string type
italian: tipo di stringa sconosciuta

# MSG_ERR_NOTERMINATEBRACKET (121//)
source: unexpected end of line (missing ')')
italian: fine linea inattesa. ( ')' mancante)

# MSG_ERR_NOBINCHARS (122//)
source: binary characters in string type None
italian: non ci sono caratteri binari in stringtype

# MSG_ERR_CTGAP (123//)
source: '%s' missing in catalog translation
italian: '%s' mancante nel file traduzione .CT

# MSG_ERR_DOUBLECTLANGUAGE (124//)
source: catalog language declared twice
italian: lingua del catalog dichiarata due volte

# MSG_ERR_DOUBLECTVERSION (125//)
source: catalog version declared twice
italian: versione del catalog dichiarata due volte

# MSG_ERR_WRONGRCSID (126//)
source: incorrect RCS Id
italian: Id RCS non corretto

# MSG_ERR_NOMEMORY (127//)
source: out of memory!
italian: Memoria insufficiente!

# MSG_ERR_NOCATALOGDESCRIPTION (128//)
source: cannot open catalog description '%s'
italian: Impossibile aprire il file descrizione '%s'

# MSG_ERR_NOCATALOGTRANSLATION (129//)
source: cannot open catalog translation '%s'
italian: Impossibile aprire il file traduzione '%s'

# MSG_ERR_NOCTVERSION (130//)
source: missing catalog translation version Use either '## version' or '## rcsid' and '## name'
italian: numero di versione mancante nel file traduzione. Usa '## version' o '## rcsid' e '## name'

# MSG_ERR_NOCATALOG (131//)
source: cannot open catalog file '%s'
italian: Impossibile aprire il file catalog '%s'

# MSG_ERR_NONEWCTFILE (132//)
source: cannot create catalog translation '%s'
italian: Impossibile creare il file traduzione '%s'

# MSG_ERR_NOCTLANGUAGE (133//)
source: missing catalog translation language
italian: Indicazione della lingua mancante nel file della traduzione

# MSG_ERR_NOSOURCE (134//)
source: cannot open source file '%s'
italian: Impossibile aprire il file sorgente '%s'

# MSG_ERR_NOSOURCEDESCRIPTION (135//)
source: cannot open source description file '%s'
italian: Impossibile aprire il file sorgente della descrizione '%s'

# MSG_ERR_NOCTARGUMENT (136//)
source: creating a catalog requires a translation file
italian: La creazione di un catalog richiede un file traduzione come argomento

# MSG_ERR_CANTCHECKDATE (137//)
source: cannot get datestamp of '%s'
italian: Impossibile ottenere il datestamp di '%s'

# MSG_ERR_NOCTFILENAME (140//)
source: Catalog translation file name not specified at command line or as basename in description
italian: Nome file catalog della traduzione non specificato nella riga di comando o come basename nella descrizione

# MSG_ERR_NOCATFILENAME (141//)
source: catalog file name not specified at command line or as basename in description
italian: nome file catalog non specificato nella riga di comando o come basename nella descrizione

# MSG_ERR_BADPREFS (142//)
source: error processing 'FlexCat.prefs' variable, falling back to defaults Template:
italian: Errore nel trattamento della variabile FlexCat.prefs. Ritorno ai parametri predefiniti. Modello:

# MSG_ERR_BADCTLANGUAGE (144//)
source: invalid language in catalog translation file Language MUST be a string with alphabetical characters and no inlined or trailing spaces
italian: Lingua non valida nel file della traduzione La lingua DEVE essere una stringa contenente caratteri dell'alfabeto e non deve contenere spazi extra o puntini di sospensione

# MSG_ERR_DOUBLECTCODESET (146//)
source: catalog codeset declared twice
italian: codeset del catalog dichiarato due volte

# MSG_ERR_BADCTCODESET (147//)
source: invalid codeset in catalog translation file Codeset MUST be a decimal number without any trailing spaces
italian: Codeset non valido nel file della traduzione Il codeset DEVE essere un numero decimale senza spazi extra o puntini di sospensione

# MSG_ERR_NOCTCODESET (148//)
source: missing catalog translation codeset
italian: Indicazione del codeset mancante nel file della traduzione

# MSG_ERR_ERROR_QUICK (149//)
source: %s - ERROR:
italian: %s - ERRORE:

# MSG_ERR_BADCTVERSION (150//)
source: invalid version string in catalog translation file Version should be something like ## version $VER: name version.revision (date) without any spaces in the name
italian: Stringa di versione non valida nel file della traduzione Il Version deve essere impostato in questo modo ## version $VER: name version.revision (date) senza nessuno spazio all'interno del nome

# MSG_ERR_WARNING_QUICK (154//)
source: %s - Warning:
italian: %s - Avviso:

# MSG_ERR_MISSINGTRANSLATION (155//)
source: missing translation for identifier '%s'
italian: Traduzione mancante per l'indentificatore '%s'

# MSG_ERR_EMPTYTRANSLATION (156//)
source: empty translation for identifier '%s'
italian: Traduzione vuota per l'indentificatore '%s'

# MSG_ERR_MISMATCHINGCONTROLCHARACTERS (157//)
source: mismatching trailing control characters
italian: caratteri di controllo non corrispondenti

# MSG_ERR_DOUBLE_IDENTIFIER (159//)
source: identifier '%s' declared twice
italian: identificatore '%s' dichiarato due volte

# MSG_ERR_STRING_TOO_SHORT (160//)
source: string too short for identifier '%s'
italian: stringa troppo corta per l'identificatore '%s'

# MSG_ERR_STRING_TOO_LONG (161//)
source: string too long for identifier '%s'
italian: stringa troppo lunga per l'identificatore '%s'

# MSG_ERR_TRAILING_ELLIPSIS (162//)
source: original string has a trailing ellipsis ('...') for identifier '%s'
italian: la stringa originale contiene dei puntini di sospensione ('...') per l'identificatore '%s'

# MSG_ERR_NO_TRAILING_ELLIPSIS (163//)
source: original string doesn't have a trailing ellipsis ('...') for identifier '%s'
italian: la stringa originale non contiene puntini di sospensione ('...') per l'identificatore '%s'

# MSG_ERR_TRAILING_BLANKS (164//)
source: original string has trailing blanks for identifier '%s'
italian: la stringa originale contiene degli spazi finali per l'identificatore '%s'

# MSG_ERR_NO_TRAILING_BLANKS (165//)
source: original string doesn't have trailing blanks for identifier '%s'
italian: la stringa originale non contiene spazi finali per l'identificatore '%s'

# MSG_ERR_MISMATCHING_PLACEHOLDERS (166//)
source: mismatching placeholders for identifier '%s'
italian: placeholder non corrispondente per l'identificatore '%s'

# MSG_ERR_MISSING_PLACEHOLDERS (167//)
source: missing placeholders for identifier '%s'
italian: placeholder mancanti per l'identificatore '%s'

# MSG_ERR_EXCESSIVE_PLACEHOLDERS (168//)
source: excessive placeholders for identifier '%s'
italian: placeholder in eccesso per l'identificatore '%s'

# MSG_ERR_NO_LEADING_BRACKET (169//)
source: missing '(' for identifier '%s'
italian: attenzione: '(' mancante per l'identificatore '%s'

# MSG_ERR_NO_TRAILING_BRACKET (170//)
source: missing ')' for identifier '%s'
italian: attenzione: ')' mancante per l'identificatore '%s'

# MSG_ERR_DOUBLE_ID (171//)
source: ID number used twice for identifier '%s'
italian: Numero ID usato due volte per l'identificatore '%s'

# MSG_ERR_NO_MIN_LEN (172//)
source: expected MinLen (character '/') for identifier '%s'
italian: atteso MinLen (carattere '/') per l'identificatore '%s'

# MSG_ERR_NO_MAX_LEN (173//)
source: expected MaxLen (character '/') for identifier '%s'
italian: atteso MaxLen (carattere '/') per l'identificatore '%s'

# MSG_ERR_EXTRA_CHARACTERS (174//)
source: extra characters at the end of the line
italian: caratteri extra alla fine della linea

# MSG_ERR_EXTRA_CHARACTERS_ID (175//)
source: extra characters at the end of the line for identifier '%s'
italian: caratteri extra alla fine della linea per l'identificatore '%s'

# MSG_ERR_NON_ASCII_CHARACTER (176//)
source: non-ASCII character 0x%02x found in original string for identifier '%s'
italian: trovato carattere non-ASCII 0x%02x nella stringa originale per l'identificatore '%s'

# MSG_ERR_NO_CAT_REVISION (177//)
source: no catalog revision information found, using revision 0
italian: informazioni sulla revision del catalog non trovate, usa revision 0

# MSG_ERR_CONVERSION_FAILED (178//)
source: UTF8 conversion failed for identifier '%s'
italian: conversione UTF8 fallita per l'identificatore '%s'

# MSG_ERR_UNKNOWN_SOURCE_CHARSET (179//)
source: ERROR in CodesetsFind(): unknown source charset '%s'
italian: ERRORE in CodesetsFind(): sorgente charset sconosciuto '%s'

# MSG_ERR_UNKNOWN_DESTINATION_CHARSET (180//)
source: ERROR in CodesetsFind(): unknown destination charset '%s'
italian: ERRORE in CodesetsFind(): destinazione charset sconosciuta '%s'

# MSG_ERR_INVALID_CHARS_FOUND (181//)
source: ERROR in CodesetsConvertStr(): %d invalid characters found
italian: ERRORE in CodesetsConvertStr(): %d trovati caratteri non validi

# MSG_ERR_ICONV_FAILED (182//)
source: ERROR in iconv(): %s
italian: ERRORE in iconv(): %s

# MSG_ERR_ICONV_OPEN_FAILED (183//)
source: ERROR in iconv_open(): %s
italian: ERRORE in iconv_open(): %s
