Repository: AmigaPorts/flexcat
Catalog: src/locale/czech.po
Languages: cs

# MSG_USAGE_HEAD (0//)
source: Usage:
cs: Použití:

# MSG_USAGE (1//)
source: CDFILE Catalog description file to scan CTFILE Catalog translation file to scan POFILE Catalog translation in PO-style format CATALOG Catalog file to create NEWCTFILE Catalog translation file to create SOURCES Sources to create; must be something like SFILE=SDFILE, where SFILE is a source file and SDFILE is a source description file WARNCTGAPS Warn about identifiers missing in translation NOOPTIM Do not skip unchanged strings in translation/description FILL Fill missing identifiers with original text FLUSH Flush memory after the catalog is created NOBEEP No DisplayBeep() on errors and warnings QUIET No warnings NOLANGTOLOWER Prevent #language name from being lowercased NOBUFFEREDIO Disable I/O buffers MODIFIED Create catalog only if description/translation have changed COPYMSGNEW Copy ***NEW*** markers over from old translation OLDMSGNEW Custom marker in old translation CODESET Codeset to force in output file (e.g. 'UTF-8') VERSION Force a certain version to be used during catalog generation REVISION Force a certain revision to be used during catalog generation NOAUTODATE no operation - kept for compatibility NOSPACES no operation - kept for compatibility
cs: CDFILE Soubor (.cd) obsahující seznam přeložitelných textů programu CTFILE Soubor (.ct) obsahující překlad textů programu POFILE Soubor obsahující překlad textů programu v .PO formátu CATALOG Výsledný soubor s překladem, tzv. katalog NEWCTFILE Soubor pro překlad programu, buď prázdný nebo aktualizovaný SOURCES Zdrojové texty, které budou vytvořeny; zadejte je ve formátu SFILE=SDFILE, kde SFILE je zdrojový text a SDFILE je zdrojový text souboru s popisem katalogu WARNCTGAPS Upozorní na chybějící identifikátory v souboru .ct NOOPTIM Vypne optimalizace, tj. v katalogu zůstanou i taková slova, která jsou stejná jak ve zdrojovém textu, tak i v překladu FILL Chybí-li překlad, doplní originální text ze zdrojového souboru FLUSH Po vytvoření katalogu zažádá systém o uvolnění zdrojů z paměti NOBEEP Při chybových hlášeních vypne funkci DisplayBeep() QUIET Vypne upozornění na chyby NOLANGTOLOWER Vypne převod direktivy language na malá písmena NOBUFFEREDIO Vypne vyrovnávací paměť pro V/V operace MODIFIED Vygeneruje katalog pouze na základě změny souborů .c(d|t) COPYMSGNEW Zapne vkládání značky **NEW** při aktualizaci překladu (.ct) OLDMSGNEW Umožní zadání jiné značky, používá-li původní překlad jinou CODESET Umožní změnu kódování ve výstupním .ct souboru (např. 'UTF-8') VERSION Umožní při tvorbě výsledného katalogu použít jeho jinou verzi REVISION Umožní při tvorbě výsledného katalogu použít jeho jinou revizi NOAUTODATE Bez účinku, zachováno jen kvůli kompatibilitě NOSPACES Bez účinku, zachováno jen kvůli kompatibilitě

# MSG_FILEUPTODATE (2//)
source: File '%s' is up to date
cs: Soubor '%s' je aktuální

# MSG_ERR_WARNING (100//)
source: %s, line %d - warning:
cs: %s, řádek č.%d - upozornění:

# MSG_ERR_ERROR (101//)
source: %s, line %d - ERROR:
cs: %s, řádek č.%d - CHYBA:

# MSG_ERR_EXPECTEDHEX (102//)
source: expected hex character (one of [0-9a-fA-F])
cs: očekáván šestnáctkový znak [0-9a-fA-F]

# MSG_ERR_EXPECTEDOCTAL (103//)
source: expected octal character (one of [0-7])
cs: očekáván osmičkový znak [0-7]

# MSG_ERR_NOLENGTHBYTES (104//)
source: lengthbytes cannot be larger than %d (sizeof long)
cs: lengthbytes nesmí být větší než %d (sizeof long)

# MSG_ERR_UNKNOWNCDCOMMAND (105//)
source: unknown catalog description command
cs: neznámý příkaz v souboru .cd

# MSG_ERR_UNEXPECTEDBLANKS (106//)
source: unexpected blanks
cs: prázdné znaky navíc

# MSG_ERR_NOIDENTIFIER (107//)
source: missing identifier
cs: chybí identifikátor

# MSG_ERR_MISSINGSTRING (115//)
source: unexpected end of file (missing catalog strings)
cs: neplatný konec souboru (chybí texty)

# MSG_ERR_UNKNOWNCTCOMMAND (118//)
source: unknown command in translation
cs: neznámý příkaz v souboru .ct

# MSG_ERR_UNKNOWNIDENTIFIER (119//)
source: '%s' missing in catalog description
cs: v souboru .cd chybí '%s'

# MSG_ERR_UNKNOWNSTRINGTYPE (120//)
source: unknown string type
cs: neznámý typ řetězce

# MSG_ERR_NOTERMINATEBRACKET (121//)
source: unexpected end of line (missing ')')
cs: neplatný konec řádku (chybí ')')

# MSG_ERR_NOBINCHARS (122//)
source: binary characters in string type None
cs: binární znaky v řetězci typu None

# MSG_ERR_CTGAP (123//)
source: '%s' missing in catalog translation
cs: v souboru .ct chybí '%s'

# MSG_ERR_DOUBLECTLANGUAGE (124//)
source: catalog language declared twice
cs: dvojí deklarace direktivy language

# MSG_ERR_DOUBLECTVERSION (125//)
source: catalog version declared twice
cs: dvojí deklarace direktivy version

# MSG_ERR_WRONGRCSID (126//)
source: incorrect RCS Id
cs: neplatné RCS Id

# MSG_ERR_NOMEMORY (127//)
source: out of memory!
cs: nedostatek volné paměti!

# MSG_ERR_NOCATALOGDESCRIPTION (128//)
source: cannot open catalog description '%s'
cs: nelze otevřít soubor '%s'.

# MSG_ERR_NOCATALOGTRANSLATION (129//)
source: cannot open catalog translation '%s'
cs: nelze otevřít soubor '%s'.

# MSG_ERR_NOCTVERSION (130//)
source: missing catalog translation version Use either '## version' or '## rcsid' and '## name'
cs: v překladu není definována direktiva version. Zadejte buď '## version' or '## rcsid' and '## name'.

# MSG_ERR_NOCATALOG (131//)
source: cannot open catalog file '%s'
cs: nelze otevřít soubor '%s'.

# MSG_ERR_NONEWCTFILE (132//)
source: cannot create catalog translation '%s'
cs: nelze vygenerovat prázdný soubor .ct (%s).

# MSG_ERR_NOCTLANGUAGE (133//)
source: missing catalog translation language
cs: v překladu není definována direktiva language.

# MSG_ERR_NOSOURCE (134//)
source: cannot open source file '%s'
cs: nelze otevřít zdrojový text '%s'.

# MSG_ERR_NOSOURCEDESCRIPTION (135//)
source: cannot open source description file '%s'
cs: nelze otevřít zdrojový text s popisem katalogu '%s'.

# MSG_ERR_NOCTARGUMENT (136//)
source: creating a catalog requires a translation file
cs: k vygenerování katalogu je třeba soubor s překladem.

# MSG_ERR_CANTCHECKDATE (137//)
source: cannot get datestamp of '%s'
cs: nelze zjistit datum a čas souboru '%s'

# MSG_ERR_NOCTFILENAME (140//)
source: Catalog translation file name not specified at command line or as basename in description
cs: chybí názvu souboru s překladem; zadejte ho buď na příkazovém řádku nebo jako direktivu basename do souboru s popisem katalogu.

# MSG_ERR_NOCATFILENAME (141//)
source: catalog file name not specified at command line or as basename in description
cs: chybí definice název katalogu; zadejte ho buď na příkazovém řádku nebo jako direktivu basename do souboru s popisem katalogu.

# MSG_ERR_BADPREFS (142//)
source: error processing 'FlexCat.prefs' variable, falling back to defaults Template:
cs: chyba při zpracování proměnné 'FlexCat.prefs'; použito výchozí nastavení. Povinná šablona:

# MSG_ERR_BADCTLANGUAGE (144//)
source: invalid language in catalog translation file Language MUST be a string with alphabetical characters and no inlined or trailing spaces
cs: neplatná direktiva language v souboru s překladem. Language MUSÍ být řetězec obsahující pouze abecední znaky a bez mezer uprostřed nebo na konci.

# MSG_ERR_DOUBLECTCODESET (146//)
source: catalog codeset declared twice
cs: dvojí deklarace direktivy codeset

# MSG_ERR_BADCTCODESET (147//)
source: invalid codeset in catalog translation file Codeset MUST be a decimal number without any trailing spaces
cs: neplatná direktiva codeset v souboru s překladem. Codeset MUSÍ být dekadické číslo a bez mezer uprostřed nebo na konci.

# MSG_ERR_NOCTCODESET (148//)
source: missing catalog translation codeset
cs: v překladu není definována direktiva codeset.

# MSG_ERR_ERROR_QUICK (149//)
source: %s - ERROR:
cs: %s - CHYBA:

# MSG_ERR_BADCTVERSION (150//)
source: invalid version string in catalog translation file Version should be something like ## version $VER: name version.revision (date) without any spaces in the name
cs: neplatná direktiva version v souboru s překladem. Řádek s Version by měl být zapsán zhruba takto: ## version $VER: název verze.revize (datum) a to bez mezer v názvu katalogu.

# MSG_ERR_WARNING_QUICK (154//)
source: %s - Warning:
cs: %s - upozornění:

# MSG_ERR_MISSINGTRANSLATION (155//)
source: missing translation for identifier '%s'
cs: chybí překlad pro '%s'

# MSG_ERR_EMPTYTRANSLATION (156//)
source: empty translation for identifier '%s'
cs: prázdný překlad pro '%s'

# MSG_ERR_MISMATCHINGCONTROLCHARACTERS (157//)
source: mismatching trailing control characters
cs: nesouhlasí koncové řídící znaky

# MSG_ERR_DOUBLE_IDENTIFIER (159//)
source: identifier '%s' declared twice
cs: identifikátor '%s' je deklarován dvakrát

# MSG_ERR_STRING_TOO_SHORT (160//)
source: string too short for identifier '%s'
cs: překlad je příliš krátký pro '%s'

# MSG_ERR_STRING_TOO_LONG (161//)
source: string too long for identifier '%s'
cs: překlad je příliš dlouhý pro '%s'

# MSG_ERR_TRAILING_ELLIPSIS (162//)
source: original string has a trailing ellipsis ('...') for identifier '%s'
cs: původní řetězec obsahuje na konci tečky ('...') pro '%s'

# MSG_ERR_NO_TRAILING_ELLIPSIS (163//)
source: original string doesn't have a trailing ellipsis ('...') for identifier '%s'
cs: původní řetězec neobsahuje na konci tečky ('...') pro '%s'

# MSG_ERR_TRAILING_BLANKS (164//)
source: original string has trailing blanks for identifier '%s'
cs: původní řetězec obsahuje na konci mezery pro '%s'

# MSG_ERR_NO_TRAILING_BLANKS (165//)
source: original string doesn't have trailing blanks for identifier '%s'
cs: původní řetězec neobsahuje na konci mezery pro '%s'

# MSG_ERR_MISMATCHING_PLACEHOLDERS (166//)
source: mismatching placeholders for identifier '%s'
cs: neshodné zástupné symboly pro '%s'

# MSG_ERR_MISSING_PLACEHOLDERS (167//)
source: missing placeholders for identifier '%s'
cs: chybějící zástupné symboly pro '%s'

# MSG_ERR_EXCESSIVE_PLACEHOLDERS (168//)
source: excessive placeholders for identifier '%s'
cs: přílišný počet zástupných symbolů pro '%s'

# MSG_ERR_NO_LEADING_BRACKET (169//)
source: missing '(' for identifier '%s'
cs: chybí '(' pro '%s'

# MSG_ERR_NO_TRAILING_BRACKET (170//)
source: missing ')' for identifier '%s'
cs: chybí ')' pro '%s'

# MSG_ERR_DOUBLE_ID (171//)
source: ID number used twice for identifier '%s'
cs: dvakrát použité identifikační číslo pro '%s'

# MSG_ERR_NO_MIN_LEN (172//)
source: expected MinLen (character '/') for identifier '%s'
cs: očekáván MinLen (znak '/') pro '%s'

# MSG_ERR_NO_MAX_LEN (173//)
source: expected MaxLen (character '/') for identifier '%s'
cs: očekáván MaxLen (znak '/') pro '%s'

# MSG_ERR_EXTRA_CHARACTERS (174//)
source: extra characters at the end of the line
cs: nadbytečné znaky na konci řádku

# MSG_ERR_EXTRA_CHARACTERS_ID (175//)
source: extra characters at the end of the line for identifier '%s'
cs: nadbytečné znaky na konci řádku pro '%s'

# MSG_ERR_NON_ASCII_CHARACTER (176//)
source: non-ASCII character 0x%02x found in original string for identifier '%s'
cs: nalezen nestandardní znak 0x%02x v původním řetězci '%s'

# MSG_ERR_NO_CAT_REVISION (177//)
source: no catalog revision information found, using revision 0
cs: nebyla nalezena informace o revizi katalogu, bude použita revize 0

# MSG_ERR_CONVERSION_FAILED (178//)
source: UTF8 conversion failed for identifier '%s'
cs: chyba při UTF8 konverzi pro '%s'

# MSG_ERR_UNKNOWN_SOURCE_CHARSET (179//)
source: ERROR in CodesetsFind(): unknown source charset '%s'
cs: CHYBA v CodesetsFind(): neznámé zdrojové kódování '%s'

# MSG_ERR_UNKNOWN_DESTINATION_CHARSET (180//)
source: ERROR in CodesetsFind(): unknown destination charset '%s'
cs: CHYBA v CodesetsFind(): neznámé cílové kódování '%s'

# MSG_ERR_INVALID_CHARS_FOUND (181//)
source: ERROR in CodesetsConvertStr(): %d invalid characters found
cs: CHYBA v CodesetsConvertStr(): %d nalezeny neplatné znaky

# MSG_ERR_ICONV_FAILED (182//)
source: ERROR in iconv(): %s
cs: CHYBA v iconv(): %s

# MSG_ERR_ICONV_OPEN_FAILED (183//)
source: ERROR in iconv_open(): %s
cs: CHYBA v iconv_open(): %s

# MSG_ERR_NO_CAT_VERSION (184//)
source: no catalog version information found, using version 0
cs: nebyla nalezena informace o verzi katalogu, bude použita verze 0
